Renova/src/Documents/ОтчетОРемонтах/ОтчетОРемонтах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОРемонтах</name>
  <registerRecords>AccumulationRegister.РемонтыИПродукция</registerRecords>
  <registerRecords>AccumulationRegister.ФабрикиИСмены</registerRecords>
  <registerRecords>AccumulationRegister.КонтрагентыИДата</registerRecords>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйПериод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>Ремонт</name>
      <type>
        <types>DocumentRef.Ремонт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/AccumulationRegisters/КонтрагентыИДата/КонтрагентыИДата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КонтрагентыИДата</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СервисныйЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокВЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/РемонтыИПродукция/РемонтыИПродукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РемонтыИПродукция</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНеисправности</name>
    <type>
      <types>CatalogRef.КодыНеисправностей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/ФабрикиИСмены/ФабрикиИСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФабрикиИСмены</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/Documents/ОтчетОРемонтах/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистры 
	Движения.КонтрагентыИДата.Записывать = Истина;
	Движения.РемонтыИПродукция.Записывать = Истина;
	Движения.ФабрикиИСмены.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРемонтах.СервисныйЦентр КАК СервисныйЦентр,
		|	ОтчетОРемонтахРемонты.Ремонт.ДатаПокупки КАК РемонтДатаПокупки,
		|	ОтчетОРемонтахРемонты.Ремонт.ДатаНачалаРемонта КАК РемонтДатаНачалаРемонта,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаЗаВыезд КАК РемонтСуммаЗаВыезд,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаЗаДетали КАК РемонтСуммаЗаДетали,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаЗаРаботы КАК РемонтСуммаЗаРаботы,
		|	ОтчетОРемонтахРемонты.Ремонт.СуммаИтого КАК РемонтСуммаИтого,
		|	ВЫБОР
		|		КОГДА ОтчетОРемонтахРемонты.Ремонт.ДатаПокупки <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ОтчетОРемонтахРемонты.Ремонт.ДатаНачалаРемонта <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА РАЗНОСТЬДАТ(ОтчетОРемонтахРемонты.Ремонт.ДатаПокупки, ОтчетОРемонтахРемонты.Ремонт.ДатаНачалаРемонта, ДЕНЬ)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СрокЭксплуатации,
		|	1 КАК Количество,
		|	ОтчетОРемонтахРемонты.Ремонт.ВидПродукции КАК РемонтВидПродукции,
		|	ОтчетОРемонтахРемонты.Ремонт.МодельПродукции КАК РемонтМодельПродукции,
		|	ОтчетОРемонтахРемонты.Ремонт.КодНеисправности КАК РемонтКодНеисправности,
		|	ОтчетОРемонтахРемонты.Ремонт.Производитель КАК РемонтПроизводитель,
		|	ОтчетОРемонтахРемонты.Ремонт.ПроизводственнаяСмена КАК РемонтПроизводственнаяСмена,
		|	ОтчетОРемонтахРемонты.Ремонт.ДатаПроизводства КАК РемонтДатаПроизводства,
		|	ОтчетОРемонтах.Дата КАК ДатаОтчета
		|ИЗ
		|	Документ.ОтчетОРемонтах.Ремонты КАК ОтчетОРемонтахРемонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРемонтах КАК ОтчетОРемонтах
		|		ПО ОтчетОРемонтахРемонты.Ссылка = ОтчетОРемонтах.Ссылка
		|ГДЕ
		|	ОтчетОРемонтах.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеКонтрагентыИДата = Движения.КонтрагентыИДата.Добавить();
		ДвижениеКонтрагентыИДата.Период = ВыборкаДетальныеЗаписи.РемонтДатаНачалаРемонта;
		ДвижениеРемонтыИПродукция = Движения.РемонтыИПродукция.Добавить();
		ДвижениеРемонтыИПродукция.Период = ВыборкаДетальныеЗаписи.РемонтДатаНачалаРемонта;
		ДвижениеФабрикиИСмены = Движения.ФабрикиИСмены.Добавить(); 
		ДвижениеФабрикиИСмены.Период = ВыборкаДетальныеЗаписи.РемонтДатаНачалаРемонта;
		// регистр КонтрагентыИДата 
		
		ДвижениеКонтрагентыИДата.СервисныйЦентр  = ВыборкаДетальныеЗаписи.СервисныйЦентр;
        ДвижениеКонтрагентыИДата.ДатаПокупки  = ВыборкаДетальныеЗаписи.РемонтДатаПокупки;
        ДвижениеКонтрагентыИДата.СрокВЭксплуатации = ВыборкаДетальныеЗаписи.СрокЭксплуатации;
		ДвижениеКонтрагентыИДата.СуммаЗаВыезд = ВыборкаДетальныеЗаписи.РемонтСуммаЗаВыезд;
        ДвижениеКонтрагентыИДата.СуммаЗаДетали = ВыборкаДетальныеЗаписи.РемонтСуммаЗаДетали;
        ДвижениеКонтрагентыИДата.СуммаЗаРаботы = ВыборкаДетальныеЗаписи.РемонтСуммаЗаРаботы;
        ДвижениеКонтрагентыИДата.СуммаИтого = ВыборкаДетальныеЗаписи.РемонтСуммаИтого;
        ДвижениеКонтрагентыИДата.Количество = ВыборкаДетальныеЗаписи.Количество;
		// регистр РемонтыИПродукция 
		ДвижениеРемонтыИПродукция.ВидПродукции = ВыборкаДетальныеЗаписи.РемонтВидПродукции;
		ДвижениеРемонтыИПродукция.МодельПродукции = ВыборкаДетальныеЗаписи.РемонтМодельПродукции; 
		ДвижениеРемонтыИПродукция.КодНеисправности = ВыборкаДетальныеЗаписи.РемонтКодНеисправности;
		ДвижениеРемонтыИПродукция.СуммаЗаВыезд = ВыборкаДетальныеЗаписи.РемонтСуммаЗаВыезд;
        ДвижениеРемонтыИПродукция.СуммаЗаДетали = ВыборкаДетальныеЗаписи.РемонтСуммаЗаДетали;
        ДвижениеРемонтыИПродукция.СуммаЗаРаботы = ВыборкаДетальныеЗаписи.РемонтСуммаЗаРаботы;
        ДвижениеРемонтыИПродукция.СуммаИтого = ВыборкаДетальныеЗаписи.РемонтСуммаИтого;
        ДвижениеРемонтыИПродукция.Количество = ВыборкаДетальныеЗаписи.Количество;
		//Регистр ФабрикиИСмены
		ДвижениеФабрикиИСмены.Фабрика = ВыборкаДетальныеЗаписи.РемонтПроизводитель;
		ДвижениеФабрикиИСмены.Смена = ВыборкаДетальныеЗаписи.РемонтПроизводственнаяСмена;
		ДвижениеФабрикиИСмены.ДатаПроизводства = ВыборкаДетальныеЗаписи.РемонтДатаПроизводства; 
		ДвижениеФабрикиИСмены.СуммаЗаВыезд = ВыборкаДетальныеЗаписи.РемонтСуммаЗаВыезд;
        ДвижениеФабрикиИСмены.СуммаЗаДетали = ВыборкаДетальныеЗаписи.РемонтСуммаЗаДетали;
        ДвижениеФабрикиИСмены.СуммаЗаРаботы = ВыборкаДетальныеЗаписи.РемонтСуммаЗаРаботы;
        ДвижениеФабрикиИСмены.СуммаИтого = ВыборкаДетальныеЗаписи.РемонтСуммаИтого;
        ДвижениеФабрикиИСмены.Количество = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;

КонецПроцедуры
